//
//  Datas.swift
//  Rizzo
//
//  Created by punyawee  on 5/5/61.
//  Copyright © พ.ศ. 2561 punyawee . All rights reserved.
//

import Foundation

class Datas {
    class func getImageQuestion() -> [ImageQuestion] {
        return [
                        ImageQuestion("กีฬาฟุตซอล", ["กีฬาฟุตบอล", "กีฬาบาส", "กีฬาวอลเล่ย์บอล", "กีฬาฟุตซอล"]),
                        ImageQuestion("กีฬาฟุตบอล", ["กีฬาฟุตบอล", "กีฬาบาส", "กีฬาวอลเล่ย์บอล", "กีฬาฟุตซอล"]),
                        ImageQuestion("ดวงอาทิตย์ขึ้น", ["ดวงอาทิตย์ขึ้น", "อากาศฝนตก", "น้ำท่วม", "น้ำตก"]),
                        ImageQuestion("ตำรวจ", ["ทหาร", "ตำรวจ", "ลูกเสือ", "รปภ"]),
                        ImageQuestion("ทหาร", ["นายก", "ผู้ประกาศข่าว", "ทหาร", "นักแต่งเพลง"]),
                        ImageQuestion("ทะเล", ["ทะเล", "ภูเขา", "น้ำตก", "บึง"]),
                        ImageQuestion("นาเกลือ", ["นาข้าว", "สวนผัก", "สวนผลไม้", "นาเกลือ"]),
                        ImageQuestion("นาข้าว", ["นาเกลือ", "สวนผัก", "สวนผลไม้", "นาข้าว"]),
                        ImageQuestion("น้ำท่วม", ["ไฟไหม้", "น้ำท่วม", "อากาศแห้ง", "ฟ้าผ่า"]),
                        ImageQuestion("ป่ากงกาง", ["ป่ากงกาง", "ป่าไม้", "ป่าดิบชื้น", "ป่าหญ้า"]),
                        ImageQuestion("ป่าไม้", ["ป่ากงกาง", "ป่าไม้", "ป่าดิบชื้น", "ป่าหญ้า"]),
                        ImageQuestion("พยาบาล", ["นางฟ้า", "ครู", "พยาบาล", "ตำรวจ"]),
                        ImageQuestion("ภูเขา", ["ทะเล", "ภูเขา", "น้ำตก", "บึง"]),
                        ImageQuestion("แม่น้ำ", ["ทะเล", "ภูเขา", "น้ำตก", "แม่น้ำ"]),
                        ImageQuestion("แมว", ["นก", "แมว", "สุนัข", "ลิง"]),
                        ImageQuestion("โรงเรียน", ["โรงเรียน", "โรงบาล", "โรงพัก", "โรงงาน"]),
                        ImageQuestion("เสือดำ", ["เสือดำ", "เปรมชัย", "แมวน้ำ", "สิงโต"]),
                        ImageQuestion("หมานอน", ["หมานั่ง", "หมานอน", "หมาหอน", "หมากระโดด"]),
                        ImageQuestion("หมานั่ง", ["หมานั่ง", "หมานอน", "หมาหอน", "หมากระโดด"]),
                        ImageQuestion("อนุสาวรีย์ชัยสมรภูมิ",["ตลาดจตุจักร","อนุสาวรีย์ชัยสมรภูมิ","ตลาดน้ำดำเนินสะดวก", "สวนสัตว์เปิดเขาเขียว"]),
                        ImageQuestion("นักเรียน", ["นักเรียน", "นักศึกษา", "นักการภารโรง", "นักวิชาการ"]),
                        ImageQuestion("วัดพระแก้ว",["สวนสัตว์เปิดเขาเขียว","วัดสายตาประกอบแว่น","วัดพระแก้ว", "วัดนู่นวัดนี่"]),
                        ImageQuestion("แอร์โฮสเตส", ["นักบิน", "แอร์โฮสเตส", "นางฟ้า", "พนักงานทำความสะอาด"]),
                        ImageQuestion("กล้วย", ["องุ่น", "ส้ม", "มะละกอ", "กล้วย"]),
                        ImageQuestion("ทุเรียน", ["องุ่น", "ทุเรียน", "มะละกอ", "กล้วย"]),
                        ImageQuestion("ส้ม", ["องุ่น", "ทุเรียน", "มะละกอ", "ส้ม"]),
                        ImageQuestion("นักศึกษา", ["นางฟ้า", "นักเรียน", "นักศึกษา", "แอร์โฮสเตส"]),
                        ImageQuestion("สะพาน", ["สะพาน", "บ้าน","อาคาร", "โรงแรม"]),
                        ImageQuestion("เด็ก", ["ผู้ใหญ่", "เด็ก","แมว", "หมา"]),
                        ImageQuestion("เด็กผู้ชาย", ["เด็กผู้หญิง", "เด็กผู้ชาย","ผู้ชาย", "ผู้หญิง"]),
                        ImageQuestion("เด็กผู้หญิง", ["เด็กผู้หญิง", "เด็กผู้ชาย","ผู้ชาย", "ผู้หญิง"]),
                        ImageQuestion("ห้องครัว", ["ห้องครัว", "ห้องน้ำ","ห้องนอน", "ห้องเก็บของ"]),
                        ImageQuestion("ช่างตัดผม", ["ช่างตัดผม", "ช่างประปา","ช่างซ่อมรถ", "ช่างไม่รู้อะไรบ้างเลย"]),
                        ImageQuestion("ช่างไฟฟ้า", ["ช่างไฟฟ้า", "ช่างประปา","ช่างซ่อมรถ", "ช่างไม่รู้อะไรบ้างเลย"]),
                        ImageQuestion("ช่างซ่อมรถ", ["ช่างไฟฟ้า", "ช่างประปา","ช่างซ่อมรถ", "ช่างไม่รู้อะไรบ้างเลย"]),
                        ImageQuestion("ช่างประปา", ["ช่างไฟฟ้า", "ช่างประปา","ช่างซ่อมรถ", "ช่างไม่รู้อะไรบ้างเลย"]),
                        ImageQuestion("วัว", ["ควาย", "แมว","หมี", "วัว"]),
                        ImageQuestion("ไก่", ["ไก่", "แมว","หมา", "ลิง"]),
                        ImageQuestion("แพะ", ["แกะ", "แพะ","หมา", "แมว"]),
                        ImageQuestion("แกะ", ["แกะ", "แพะ","หมา", "แมว"]),
                        ImageQuestion("ม้า", ["แกะ", "แพะ","ม้า", "แมว"]),
                        ImageQuestion("หมี", ["ควาย", "แมว","หมี", "วัว"]),
                        ImageQuestion("กวาง", ["ควาย", "กวาง","หมี", "วัว"]),
                        ImageQuestion("ปู", ["กุ้ง", "ปู","กั้ง", "กบ"]),
                        ImageQuestion("จระเข้", ["จระเข้", "ตัวเงินตัวทอง","กิ่งก้า", "จิ้งเหลน"]),
                        ImageQuestion("ม้าน้ำ", ["ม้า", "ม้าหมุน","ม้าน้ำ", "ม้ามี้"]),
                        ImageQuestion("แมวน้ำ", ["แมว", "แมวน้ำ","สิงโตทะเล", "ฮิปโป"]),
                        ImageQuestion("ฉลาม", ["ฉลาม", "โลมา","วาฬ", "ปิงทะเล"]),
                        ImageQuestion("ปลาดาว", ["ปลาหมึก", "หอย","ปะการัง", "ปลาดาว"]),
                        ImageQuestion("ค้างคาว", ["หนู", "ค้างคาว","หนู", "กระรอก"]),
                        ImageQuestion("ผึ้ง", ["ต่อ", "แตน","ผึ้ง", "ผีเสื้อ"]),
                        ImageQuestion("นก", ["นก", "ค้างคาว","กระรอก", "กระแต"]),
                        ImageQuestion("ผีเสื้อ", ["นก", "ค้างคาว","ผีเสื้อ", "ใบไม้"]),
                        ImageQuestion("แมลงปอ", ["แมลงปอ", "แมลงป่อง","แมลงภู่", "แมลงวัน"]),
                        ImageQuestion("นกอินทรี", ["เหยี่ยว", "นกอนินทรี","นกอินทรี", "นกพิราบ"]),
                        ImageQuestion("นกกระจอกเทศ", ["นกกระจอกเทศ", "นกเพนกวิน","นกกระจอก", "นกพิราบ"]),
                        ImageQuestion("ต่อยมวย", ["ต่อยมวย", "เต้น","เตะบอล", "ชู้ตบาส"]),
                        ImageQuestion("ชู้ตบาส", ["เลี้ยงบอล", "เลี้ยงบาส","เตะบอล", "ชู้ตบาส"]),
                        ImageQuestion("ยิงธนู", ["ยิงปืน", "ยิงธนู", "ยิงหนังสะติ๊ก", "ยิงลูกแก้ว"]),
                        ImageQuestion("วาดรูป", ["วาดรูป", "แต่งเพลง","ดูหนัง", "ฟังเพลง"])
        ]
    }
    class func getSoundQuestions() -> [SoundQuestion] {
        return [
            SoundQuestion("แมว", ["ค้างคาว", "อีเห็น", "แมว", "นกฮูก"]),
            SoundQuestion("วัว", ["เสือโคร่ง", "ไก่", "ช้าง", "วัว"]),
            SoundQuestion("สุนัข", ["สุนัข", "แมว", "เสือดำ", "ลุงตู่"]),
            SoundQuestion("เป็ด", ["เป็ด", "คนหัวเราะ", "ไก่", "หมี"]),
            SoundQuestion("ช้าง", ["แตรรถ", "ช้าง", "ยีราฟ", "ยักเขียว"]),
            SoundQuestion("กบ", ["ค้างคาว", "กบ", "งู", "นก"]),
            SoundQuestion("ม้า", ["ฟ้าร้อง", "หมู", "ลิง", "ม้า"]),
            SoundQuestion("ลิง", ["นก", "เด็กร้อง", "ลิง", "ไก่"]),
            SoundQuestion("นกฮูก", ["นกฮูก", "นกขุนทอง", "นกเป็ดน้ำ", "ตุ่นปากเป็ด"]),
            SoundQuestion("หมู", ["สิงโตทะเล", "หมู", "เสือดาว", "หมีดำ"]),
            SoundQuestion("แกะ", ["นกแก้ว", "อีเห็น", "แกะ", "เด็กร้องไห้"]),
            SoundQuestion("เครื่องบิน", ["เครื่องบิน", "รถยนต์", "เรือ", "ฟ้าร้อง"]),
            SoundQuestion("ต่อสู้", ["ต่อสู้", "ตีกลอง", "รถชน", "ไม่มีคำตอบที่ถูก"]),
            SoundQuestion("รถเบรค", ["ช้าง", "รถเบรค", "หมาร้อง", "เลื่อยไม้"]),
            SoundQuestion("สนุ๊กเกอร์", ["ตีกอล์ฟ", "ฟ้าร้อง", "กิ่งไม้หัก", "สนุ๊กเกอร์"]),
            SoundQuestion("รถ", ["เป็นไปได้ทั้งหมด", "จรวด", "รถ", "เครื่องบิน"]),
            SoundQuestion("ปิดประตู", ["กลอง", "ปิดหน้าต่าง", "ปิดประตู", "ยิงปืน"]),
            SoundQuestion("แซ่", ["แซ่", "ตบหัว", "ประทัด", "ยิงปืน"]),
            SoundQuestion("ตีกลอง", ["ของตกจากที่สูง", "ตีกลอง", "ระเบิด", "ฟ้าร้อง"]),
            SoundQuestion("คลื่น", ["ฝนตก", "น้ำตก", "รินน้ำ", "คลื่น"]),
            SoundQuestion("ตีกอล์ฟ", ["ตีกอล์ฟ", "ตีเบสบอล", "ตบหน้า", "เตะฟุตบอล"]),
            SoundQuestion("ชักดาบ", ["ตีเหล็ก", "ชักดาบ", "หั่นหมู", "สตาร์ทรถ"]),
            SoundQuestion("เล่นบาสเก็ตบอล", ["เล่นบาสเก็ตบอล", "ฝนตก", "เกวียนวิ่ง", "ม้าหมุน"])
        ]
    }
}
